{"code": "6A00", "diagnostic_category": "Neurodevelopmental disorders", "specific_disorder": "Disorders of intellectual development", "chinese_name": "智力发育障碍", "definition": "Intellectual Developmental Disorder (IDD) is a group of disorders with differing etiologies originating during the developmental period, characterized by significantly subaverage intellectual functioning and adaptive behavior. Based on appropriately normed and standardized assessments, intelligence quotient (IQ) is typically two or more standard deviations below the mean (approximately below the 2.3rd percentile). In the absence of appropriate normed and standardized testing, diagnosis relies more heavily on clinical judgment, utilizing suitable comparative behavioral indicators as the basis for evaluation.", "clinical_manifestations": "Intellectual impairment: Poor comprehension, with difficulty in acquiring basic knowledge and skills. Delayed calculation ability, unable to perform simple mathematical operations. Limited language expression and communication skills, with difficulties in social interactions.\n\nDeficits in adaptive behavior: Weak ability in activities of daily living, requiring assistance from others to complete routine tasks. Deficient social skills, making it difficult to establish stable interpersonal relationships. Restricted occupational development, with significant difficulty undertaking complex work tasks.", "symptom": "Typical Symptoms\n\nLearning difficulties: Difficulty in acquiring new knowledge and skills, particularly in academic domains such as language, reading, writing, and mathematics. Learning progress is significantly slower than that of peers (high, 70%-90%).\n\nImmature behavior: Behavioral patterns inconsistent with chronological age, manifesting as childlike behaviors. Social skills and emotional expression are incongruent with developmental level (high, 70%-80%).\n\nLimited self-care ability: Difficulty in independently performing basic activities of daily living (e.g., dressing, eating, personal hygiene). Continuous support is required for complex life tasks (high, 60%-80%).\n\nOther Possible Symptoms\n\nEmotional problems: Prone to agitation, anxiety, or depressive states. Insufficient emotional regulation capacity (moderate, 40%-60%).\n\nCommunication disorders: Language comprehension and expression are below developmental expectations. May rely on non-verbal communication (e.g., gestures, facial expressions) to express needs (moderate, 40%-60%).\n\nPoor social adaptability: Difficulty in complying with rules in environments such as home and school. Social interaction skills are limited (low, 30%-50%).", "diagnostic_criteria": "Essential Criteria (Diagnostic Basis):\n\nIntellectual functioning below average: An IQ score below 70 based on standardized intelligence tests (such as the Wechsler Intelligence Scale).\nSignificant limitations in adaptive behavior: Marked deficits in comparison to peers in areas such as daily living skills, social interaction, and communication, as assessed by standardized instruments (e.g., Vineland Adaptive Behavior Scales).\n\nSupporting Criteria (Clinical and Epidemiological Basis):\n\nOnset during the developmental period: Symptoms and signs manifest before the age of 18.\nGenetic and congenital factors: Chromosomal abnormalities (e.g., Down syndrome), genetic defects, etc.\nPerinatal risk factors: Maternal infections during pregnancy, exposure to harmful substances, malnutrition, or birth injury during delivery.\nAcquired factors: Neurodevelopmental abnormalities, infectious encephalitis, traumatic brain injury, metabolic diseases, malnutrition, etc.\n\nThreshold Standards:\n\nDiagnosis can be established if both essential criteria are met.\nIn the absence of standardized testing, clinical judgment must be applied, integrating detailed patient history, family history, and comprehensive assessment findings."}
{"code": "6A01", "diagnostic_category": "Neurodevelopmental disorders", "specific_disorder": "Developmental speech or language disorders", "chinese_name": "发育性言语或语言障碍", "definition": "Developmental speech or language disorder is a neurodevelopmental condition that occurs in early childhood, characterized by significant difficulties in the comprehension and/or use of spoken communication. These difficulties exceed the normal variations expected for the individual’s age and intellectual level, and cannot be fully explained by hearing impairment, anatomical abnormalities, or other clearly identified neurological disorders. According to the ICD-11 classification, this disorder includes the following subtypes: developmental speech sound disorder (6A01.0), developmental fluency disorder (6A01.1), and developmental language disorder (6A01.2), the latter of which can be further divided into expressive language disorder and receptive language disorder.", "clinical_manifestations": "Symptom characteristics: \n\nLanguage comprehension difficulties: Poor ability to understand complex sentences; difficulty following multi-step instructions.\n\nLimited vocabulary: Acquisition of new words is slower than in peers; frequent word-finding difficulties.\n\nSimplified grammatical structures: Frequent omission of syntactic components in speech, use of telegraphic language.\n\nUnclear pronunciation: Presence of numerous non-standard speech phenomena such as sound substitution and sound omission.\n\nFluency problems: Frequent pauses, repetition of words or phrases; sometimes accompanied by stuttering behaviors.\n\nAccompanying symptoms: May be associated with dyslexia, dysgraphia, or other learning difficulties. Some children may also exhibit attention deficit or ADHD-like behavioral characteristics.", "symptom": "Typical Symptoms\n\nLanguage Comprehension Difficulties: Impaired ability to understand complex sentences; difficulty following multi-step instructions (70%-90%).\n\nLimited Vocabulary: Slower acquisition of new words compared to age-matched peers; frequent word-finding difficulties (60%-80%).\n\nSimplified Grammatical Structure: Frequent omission of syntactic elements during speech; use of telegraphic language (50%-70%).\n\nImprecise Articulation: Numerous errors in pronunciation, including sound substitutions and omissions (60%-80%).\n\nFluency Issues: Frequent pauses, repetition of words or phrases; occasionally accompanied by stuttering behaviors (40%-60%).\n\nOther Possible Symptoms\n\nImpaired Social Interaction: Deficient social skills; difficulty effectively participating in social communication activities (30%-50%).\n\nLearning Difficulties: Academic performance in language subjects is affected; delayed development of reading comprehension and writing skills (40%-60%).\n\nAttention Deficit or ADHD-like Behaviors: Inattention, hyperactivity, or impulsive behavior (20%-40%).", "diagnostic_criteria": "Gold Standard:\nClinical Assessment and Standardized Testing: Comprehensive clinical assessment conducted by a qualified speech-language pathologist, combined with the results of standardized language tests such as the Peabody Picture Vocabulary Test (PPVT) and the Goldman-Fristoe Test of Articulation (GFTA).\n\nMandatory Criteria (Diagnostic Basis):\nDifficulty in Language Comprehension: Significantly lower scores than age-matched peers in understanding complex sentences as measured by standardized language tests.\nLimited Vocabulary: Slower acquisition of new words compared to peers, with frequent difficulty in word retrieval.\nSimplified Grammatical Structure: Frequent omission of syntactic elements and use of telegraphic speech during verbal expression.\nUnclear Articulation: Presence of numerous non-standard pronunciations, including phoneme substitutions and omissions.\nFluency Issues: Frequent pauses, repetition of words or phrases; occasionally accompanied by stuttering behaviors.\n\nSupportive Criteria (Clinical and Epidemiological Basis):\nFamily History: Family history of developmental speech or language disorders.\nImpaired Social Interaction: Deficits in social skills, with difficulty effectively engaging in social communication and activities.\nLearning Difficulties: Poor academic performance in language-related subjects, with delayed development in reading comprehension and writing skills.\nAttention Deficit or ADHD-like Behaviors: Inattention, hyperactivity, or impulsive behaviors.\n\nThreshold Criteria:\nMeets at least two of the \"Mandatory Criteria\" and scores significantly below the age-appropriate mean on standardized language tests.\nNo other identifiable causes (such as hearing loss, anatomical abnormalities, or other neurological disorders) can account for these symptoms."}
{"code": "6A02", "diagnostic_category": "Neurodevelopmental disorders", "specific_disorder": "Autism spectrum disorder", "chinese_name": "孤独症谱系障碍", "definition": "Autism Spectrum Disorder (ASD) is a group of neurodevelopmental disorders characterized by persistent deficits in social interaction and social communication abilities, along with a range of restrictive, repetitive, and inflexible patterns of behavior, interests, or activities. These symptoms are distinctly atypical or excessive relative to the individual's age and sociocultural context. The onset of ASD typically occurs during the developmental period, especially in early childhood, although the condition may not become fully apparent until social demands exceed the individual's limited capacities. These deficits are severe enough to result in impairment in personal, familial, social, educational, occupational, or other important areas of functioning, and they generally represent a pervasive feature of the individual's functioning, observable across all settings, although the presentation may vary depending on the environment.", "clinical_manifestations": "Social Interaction Impairment: Patients with ASD exhibit pronounced difficulties in social interactions, including a lack of eye contact, impaired understanding and use of facial expressions and body language, as well as difficulty in establishing and maintaining interpersonal relationships. They may lack understanding of others' emotions and intentions and often struggle to participate in group activities.\n\nCommunication Impairment: Deficits in both verbal and non-verbal communication abilities are among the core features of ASD. Patients may present with delayed language development, difficulties in language expression and comprehension, stereotyped and repetitive use of language, and deficits in non-verbal communication skills such as gestures and body language.\n\nAbnormal Behavioral Patterns: Patients with ASD demonstrate a range of restricted, repetitive, and inflexible behavioral patterns, including stereotyped movements (such as hand flapping or object spinning), intense interests in specific objects or activities, insistence on fixed routines and rituals, and heightened sensitivity to and resistance against changes in the environment.", "symptom": "Typical Symptoms\n\nSocial Interaction Impairment: Difficulty in establishing and maintaining interpersonal relationships, presence of abnormal eye contact (such as lack of or excessive eye contact), impaired ability to interpret facial expressions and share emotions (90%-95%). Inability to understand others' emotions and intentions, exhibiting lack of or reduced interest in social interactions (80%-90%).\n\nLanguage Development Disorders: Delayed or abnormal language development, with some patients possibly having no verbal ability at all or possessing only a limited vocabulary (50%-60%). Repetitive or echolalic speech (echolalia), and pragmatic language impairment (such as difficulty maintaining conversations, literal interpretation of language) (70%-80%).\n\nRestricted Interests: Markedly restricted and fixed interests in specific objects or activities, with the subject of interest often being non-functional (80%-90%). Stereotyped and repetitive behavioral patterns may be observed, such as lining up objects or body rocking (70%-80%).\n\nStereotyped and Repetitive Behaviors: Engaging in stereotyped or repetitive motor movements (e.g., body rocking, hand-flapping) (70%-80%). Insistence on fixed routines, with extreme sensitivity to changes in the environment (80%-90%).\n\nOther Possible Symptoms\n\nEmotional and Behavioral Abnormalities: Difficulty in emotional regulation, possible occurrence of unexplained emotional outbursts (such as screaming or crying) (40%-50%). Aggressive behaviors or self-injurious behaviors (20%-30%).\n\nSensory System Issues: Hyper- or hypo-responsiveness to sensory stimuli such as sound, light, or tactile sensation (70%-80%). Presence of specific food preferences or aversions (40%-50%).", "diagnostic_criteria": "Mandatory Criteria (Diagnostic Basis):\nDiagnostic and Statistical Manual of Mental Disorders, Fifth Edition (DSM-5) Criteria:\nPersistent deficits in social interaction and social communication: At least two of the following symptoms must be present:\nLack of social-emotional reciprocity, such as eye contact, facial expression, and nonverbal communication.\nDifficulty understanding the emotions and intentions of others.\nImpaired ability to establish and maintain interpersonal relationships.\nRestricted, repetitive, and inflexible patterns of behavior: At least one of the following symptoms must be present:\nStereotyped or repetitive motor movements (e.g., hand-flapping, spinning objects).\nIntense interest in specific objects or activities with highly restricted range of interest.\nInsistence on fixed daily routines and rituals; marked sensitivity to changes in the environment.\n\nSupporting Criteria (Clinical and Epidemiological Basis):\nDevelopmental History:\nOnset typically occurs during early developmental stages, especially before 3 years of age.\nSocial and communicative deficits are observable across different settings.\nFamily History:\nFamily members affected by autism or other neurodevelopmental disorders.\nOther Medical Evidence:\nGenetic testing reveals specific gene mutations (e.g., SHANK3, NLGN3).\nNeuroimaging indicates structural and functional abnormalities in the brain.\n\nThreshold Criteria:\nAll standards outlined in the “Mandatory Criteria” must be met.\nAt least one item from the Supporting Criteria must be present."}
{"code": "6A03", "diagnostic_category": "Neurodevelopmental disorders", "specific_disorder": "Developmental learning disorder", "chinese_name": "发育性学习障碍", "definition": "Developmental Learning Disorder (DLD) refers to persistent neurodevelopmental difficulties in acquiring and utilizing specific academic skills. It is primarily characterized by abilities in areas such as reading, written expression, or mathematics that are significantly below the expected level for the individual's age group. The academic performance of individuals with DLD is markedly inconsistent with their intellectual capabilities and cannot be attributed solely to sensory deficits (e.g., uncorrected visual or auditory impairment), neurological disorders, motor function disorders, deprivation of educational opportunities, differences in language environment, or psychosocial factors. The disorder typically becomes evident during the period of formal instruction of school-age skills and persistently impacts academic achievement and daily activities that require these skills.", "clinical_manifestations": "Symptom Characteristics:  \nReading Disorder: slow letter naming, difficulty with phonological segmentation, decreased accuracy in reading comprehension.  \nWriting Disorder: unstable grapheme memory, errors in application of spelling rules, disorganized and illogical writing structure.  \nMathematics Disorder: delayed quantity and magnitude comparison, procedural errors in calculation, inaccurate understanding of mathematical symbols.  \nMixed-Type Manifestations: deficits in different skill domains may coexist, but each subtype’s diagnostic criteria must be met.\n\nFunctional Impact:  \nAcademic performance is significantly behind instructional expectations, often accompanied by behaviors such as task avoidance and learned helplessness. Secondary emotional problems (e.g., anxiety) may become prominent with increased academic pressure, but must be differentiated from primary emotional disorders.", "symptom": "Typical Symptoms\n\nReading difficulties: Slow word recognition, skipping lines or omitting words, limited reading comprehension due to insufficient decoding accuracy (60%-80%).\n\nWriting difficulties: Frequent spelling errors, clumsy writing movements, disorganized text structure (50%-70%).\n\nImpaired mathematical skills: Difficulty recognizing numbers, calculation errors, impaired understanding of quantitative concepts (40%-60%).\n\nOther possible symptoms\n\nDifficulty with attention and concentration: Insufficient task persistence; ADHD comorbidity should be excluded (30%-50%).\n\nPoor memory: Limited phonological working memory capacity, slowed information processing speed (20%-40%).\n\nEmotional and behavioral problems: Anxiety triggered by academic frustration, avoidance of learning-related activities (20%-30%).", "diagnostic_criteria": "Mandatory Criteria (Diagnostic Basis):\n\nSignificantly Below-Expected Academic Skills: The patient demonstrates skill levels in specific academic domains such as reading, writing, or arithmetic that are markedly below standards expected for their age and general intellectual level.\n\nPersistence and Severity: These difficulties are persistent and cause significant interference with academic achievement or occupational functioning.\n\nExclusion of Other Causes: The difficulties cannot be fully explained by intellectual developmental disorder, sensory impairments (visual or auditory), neurological or motor disorders, lack of educational opportunities, insufficient language proficiency, or psychosocial adversity.\n\nSupporting Criteria (Clinical and Epidemiological Basis):\n\nTypical Clinical Manifestations:\n\nReading Difficulties: Slow word recognition, skipping lines or missing words, poor comprehension.\n\nWriting Difficulties: Frequent spelling errors, improper use of grammar and punctuation, disorganized composition structure.\n\nImpaired Mathematical Abilities: Difficulty recognizing numbers, calculation errors, impaired understanding of applied problems.\n\nAssociated Symptoms:\n\nDifficulty maintaining attention, poor memory, emotional and behavioral issues (such as reduced self-esteem, increased anxiety and depressive mood).\n\nFamily History: Presence of similar learning disabilities in family members.\n\nEarly Identification: Typically first identified during the early school years when related academic skills are being taught.\n\nThreshold Criteria:\n\nA diagnosis can be established if all items under the “Mandatory Criteria” are met.\n\nMultiple items under the “Supporting Criteria” provide further confirmation of the diagnosis."}
{"code": "6A04", "diagnostic_category": "Neurodevelopmental disorders", "specific_disorder": "Developmental motor coordination disorder", "chinese_name": "发展性运动协调障碍", "definition": "Developmental Coordination Disorder (DCD) is a neurodevelopmental disorder characterized primarily by significant delays in the acquisition of gross and fine motor skills, along with impairments in the execution of coordinated motor activities. Individuals with DCD typically exhibit motor performance that is clumsy, slow, or inaccurate, and these deficits are markedly below expectations based on their age and intellectual level. Such difficulties are observable in early development and result in functional limitations in daily life, academic performance, occupational tasks, and recreational activities. The symptoms of DCD cannot be fully explained by neurological disorders, musculoskeletal or connective tissue diseases, sensory impairments, or intellectual disability.", "clinical_manifestations": "Symptom Characteristics: \n\nGross motor skill impairment: unsteady gait, abnormal running posture, instability upon landing from jumping, etc.\n\nFine motor skill impairment: messy handwriting, slow buttoning, difficulty using scissors, etc.\n\nBalance and coordination problems: easily loses balance while standing, short duration of single-leg stance, poor control when riding a bicycle, etc.\n\nImpact on daily activities: limitations in self-care abilities such as dressing, eating, and personal hygiene; significantly greater difficulty participating in team games or sports activities.", "symptom": "Typical Symptoms\n\nGross Motor Skill Impairment:\nUnsteady Walking: Gait instability during ambulation, with a tendency to fall or collide with objects (common, 50%-70%).\nAbnormal Running Posture: Poor coordination of arm movements and disorganized gait while running (common, 40%-60%).\nInstability Upon Landing from Jumping: Difficulty achieving stable landings during jumps; frequent loss of balance (common, 30%-50%).\n\nFine Motor Skill Impairment:\nMessy Handwriting: Illegible handwriting characterized by distorted and inconsistent letter size, making it difficult to recognize (common, 60%-80%).\nSlow Buttoning: Slowness and difficulty performing tasks such as buttoning clothes or tying shoelaces (common, 50%-70%).\nDifficulty Using Scissors: Clumsy actions when using scissors or other tools; inability to complete tasks efficiently (common, 40%-60%).\n\nImpact on Daily Activities:\nDifficulty Dressing: Requires extended time to dress independently, and frequently wears clothes incorrectly or reverses them (common, 50%-70%).\nProblems with Eating: Poor coordination when using utensils, resulting in frequent spilling of food (common, 40%-60%).\nSelf-care Limitations: Restricted ability to perform personal hygiene tasks such as tooth brushing and washing the face (common, 30%-50%).\n\nChallenges in Participating in Team Games or Sports Activities:\nClumsiness: Displays pronounced motor awkwardness in group games; struggles to keep pace with peers (common, 40%-60%).\nLack of Confidence: Diminished self-esteem resulting from poor motor skills; reluctance to participate in sports activities (common, 30%-50%).\n\nOther Possible Symptoms\n\nVisual-Spatial Processing Impairment:\nDifficulty with Object Localization: Impaired ability to accurately locate objects in complex environments (less common, 10%-20%).\nPoor Sense of Direction: Prone to becoming lost or unable to find correct routes (less common, 10%-20%).\n\nSensory Integration Issues:\nTactile Hypersensitivity: Excessive sensitivity to certain textures or tactile sensations (less common, 10%-20%).\n\nAuditory Processing Impairment: Marked sensitivity to noise or difficulty discriminating between different sounds (less common, 10%-20%).", "diagnostic_criteria": "Required Criteria (Diagnostic Basis):\n\nSignificant Motor Skill Delay: The patient demonstrates motor performance in acquiring and executing gross or fine motor skills that is markedly below expectations compared to peers of similar age and intellectual level.\n\nFunctional Impairment: The delay in motor skills results in limitations in daily living activities, schoolwork, occupational performance, and recreational pursuits.\n\nExclusion of Other Causes: The motor skill delay cannot be entirely explained by neurological disorders, musculoskeletal or connective tissue diseases, sensory impairments, or intellectual developmental disorders.\n\nSupporting Criteria (Clinical and Epidemiological Basis):\n\nTypical Clinical Manifestations:\n\nGross Motor Skill Impairments: Unsteady gait, abnormal running posture, instability upon jumping and landing, etc.\n\nFine Motor Skill Impairments: Poor handwriting, slow buttoning, difficulty using scissors, etc.\n\nBalance and Coordination Problems: Easily loses balance when standing, short duration of single-leg stance, poor control when riding a bicycle, etc.\n\nImpact on Daily Activities: Restricted ability in self-care activities such as dressing, eating, personal hygiene; marked difficulty when participating in team games or sports activities.\n\nFamily History: Other family members exhibit similar motor coordination disorders.\n\nPerinatal Risk Factors: Prematurity, low birth weight, neonatal asphyxia, etc.\n\nThreshold Criteria:\n\nAll items under “Required Criteria” must be met.\n\nAt least two typical clinical manifestations under “Supporting Criteria” are present.\n\nSignificant motor skill delay is confirmed by standardized assessment tools (e.g., the Wechsler Developmental Coordination Motor Function Assessment)."}
{"code": "6A05", "diagnostic_category": "Neurodevelopmental disorders", "specific_disorder": "Attention deficit hyperactivity disorder", "chinese_name": "注意缺陷多动障碍", "definition": "Attention-Deficit/Hyperactivity Disorder (ADHD) is a neurodevelopmental disorder primarily characterized by persistent inattention, hyperactivity, and impulsivity. These symptoms must be evident during early developmental stages (typically before the age of 12), persist for at least 6 months, and cause significant negative impact on academic, occupational, or social functioning. The symptoms of ADHD must be clearly inconsistent with the individual's age, developmental level, and intellectual abilities, and must be observable in two or more different settings (such as home and school).", "clinical_manifestations": "Symptom characteristics:\n\nInattention: Easily distracted during tasks requiring sustained attention; frequently avoids activities that demand prolonged mental effort; exhibits a high rate of forgetfulness in daily activities.\n\nHyperactivity: Excessive motor activity disproportionate to developmental level (e.g., school-aged children unable to remain seated); may internalize as subjective restlessness after adolescence.\n\nImpulsivity: Deficits in behavioral inhibition manifested as interrupting others, making hasty decisions, and difficulty adhering to turn-taking rules in group activities.", "symptom": "Typical Symptoms\n\nAttention Deficit: Difficulty sustaining attention, easily distracted, lack of attention to detail, frequent careless mistakes (70%-90%). Poor organizational skills, difficulty completing tasks, frequently lose items or forget daily activities (60%-80%). Difficulty with tasks requiring sustained attention (such as reading, listening to lectures) (50%-70%).\n\nHyperactivity-Impulsivity: Excessive activity, difficulty sitting still, behaviors such as running or climbing in inappropriate settings (60%-80%). Impulsive behaviors, such as difficulty waiting for turn, frequently interrupting others (50%-70%). Inability to participate quietly in activities, presenting as restlessness or agitation (40%-60%).\n\nOther Possible Symptoms\n\nFunctional Impairment: Academic underachievement, difficulty completing assignments (50%-70%). Strained social relationships, prone to conflicts (40%-60%).\n\nEmotional and Sleep Problems: Emotional instability, irritability, or low mood (30%-50%). Sleep disturbances (such as difficulty falling asleep, interrupted sleep) (20%-40%).", "diagnostic_criteria": "Mandatory Criteria (Diagnostic Basis):\n\nSymptom Criteria: According to the Diagnostic and Statistical Manual of Mental Disorders, Fifth Edition (DSM-5) by the American Psychiatric Association or the International Classification of Diseases, 11th Revision (ICD-11) by the World Health Organization, at least 6 of the following symptoms (5 for individuals aged 17 years and older) must be present. These symptoms must have appeared before the age of 12 and have persisted for at least 6 months.\n\nInattention:\n- Often fails to give close attention to details or makes careless mistakes in schoolwork, work, or other activities.\n- Often has difficulty sustaining attention in tasks or play activities.\n- Often does not seem to listen when spoken to directly.\n- Often does not follow through on instructions and fails to finish schoolwork, chores, or duties in the workplace (not due to oppositional behavior or failure to understand instructions).\n- Often has difficulty organizing tasks and activities.\n- Often avoids, dislikes, or is reluctant to engage in tasks that require sustained mental effort (such as schoolwork or homework).\n- Often loses things necessary for tasks or activities (e.g., toys, assignments, pencils, books, or tools).\n- Is often easily distracted by extraneous stimuli.\n- Is often forgetful in daily activities.\n\nHyperactivity-Impulsivity:\n- Often fidgets with or taps hands or feet, or squirms in seat.\n- Often leaves seat in situations when remaining seated is expected, such as in the classroom or other settings.\n- Often runs about or climbs in situations where it is inappropriate (in adolescents or adults, may be limited to feelings of restlessness).\n- Often unable to play or engage in leisure activities quietly.\n- Is often “on the go,” acting as if “driven by a motor.”\n- Often talks excessively.\n- Often blurts out answers before a question has been completed.\n- Often has difficulty waiting for their turn.\n- Often interrupts or intrudes on others (e.g., butts into conversations or games).\n\nSupportive Criteria (Clinical and Epidemiological Basis):\n\nFunctional Impairment: The above symptoms cause significant impairment in social, academic, or occupational functioning.\n\nManifestation in Multiple Settings: Symptoms are present in two or more settings (e.g., at home, at school, or in the workplace).\n\nExclusion of Other Disorders: The symptoms are not better explained by another mental disorder (such as mood disorders, anxiety disorders, dissociative disorders, personality disorders, etc.).\n\nThreshold Criteria:\n\nAt least 6 of the mandatory criteria (5 for individuals aged 17 years and older) must be met.\n\nThe symptoms must have a significant negative impact on the patient's daily life and functioning."}
{"code": "6A06", "diagnostic_category": "Neurodevelopmental disorders", "specific_disorder": "Stereotyped movement disorder", "chinese_name": "刻板性运动障碍", "definition": "Stereotyped Movement Disorder (6A06) is a neurodevelopmental disorder characterized by persistent, repetitive, non-purposeful, and fixed-pattern involuntary motor behaviors that occur during the developmental period. These behaviors are not directly attributable to the effects of a substance/drug or other neurological disorders (such as epileptic seizures), and they significantly interfere with social functioning or result in physical injury. Non-self-injurious manifestations include body rocking, head nodding, and finger flapping; self-injurious behaviors may manifest as repetitive head banging, hand biting, face slapping, or skin scratching.", "clinical_manifestations": "Stereotyped Movement Disorder (6A06) is a neurodevelopmental disorder characterized by persistent, repetitive, purposeless, and fixed-pattern involuntary motor behaviors that arise during the developmental period. These behaviors are not directly attributable to substance or drug effects, nor to other neurological disorders (such as epileptic seizures), and they significantly interfere with social functioning or result in physical injury. Non-self-injurious manifestations include body rocking, head shaking, and finger flapping; self-injurious behaviors may present as repetitive head banging, hand biting, face slapping, or skin scratching.", "symptom": "Typical Symptoms\n\nRepetitive, purposeless movements: Includes body rocking, hand clapping, hand flapping, spinning objects, etc. (high, 70%-90%). (Revision note: Trichotillomania and nail biting have been excluded as non-typical movements, as these are more commonly observed in other distinct diagnoses such as trichotillomania.)\n\nStereotyped behavioral patterns: The individual exhibits fixed, rhythmic movements, such as body rocking or head nodding (high, 80%-95%).\n\nProlonged duration of movements: These movements usually persist for several months or longer and typically manifest in early childhood (high, 80%-90%). (Revision note: “Early developmental stage” has been changed to “early childhood” to align with the ICD-11 course criteria.)\n\nOther Possible Symptoms\n\nAccompanied by anxiety or tension: Some patients may experience inner unease or anxiety while performing these movements (low, 10%-30%).\n\nImpaired social functioning: Stereotyped behaviors significantly interfere with normal social activities, resulting in social impairment (moderate, 40%-60%).\n\nSelf-injurious behavior: A subset of patients may exhibit self-injurious behaviors, such as repetitive head banging or body slapping (low, 5%-15%). (Revision note: Extreme behaviors such as eye poking have been excluded, as they are more commonly observed in severe neurodevelopmental disorders rather than isolated stereotypic movement disorder.)", "diagnostic_criteria": "Gold Standard:\nMedical History and Clinical Observation: Through detailed history taking and clinical observation, it is confirmed that the patient demonstrates persistent, voluntary, repetitive, stereotyped, and clearly purposeless movements. These movements typically manifest during the early developmental period and significantly interfere with the individual’s normal activities or result in self-injurious behaviors.\n\nRequired Criteria:\nTypical Symptoms:\nPersistent, voluntary, repetitive, stereotyped, and clearly purposeless movements, such as body rocking, head rolling, finger snapping, hand clapping, etc.\nThese movements generally begin to appear during early developmental stages and persist for more than several months.\n\nExclusion of Other Causes:\nExclude similar behaviors directly induced by the physiological effects of substances or medications.\nExclude primary manifestations of other neurodevelopmental disorders or mental health conditions.\n\nSupporting Criteria:\nAssociated Symptoms:\nAccompanied by anxiety or tense mood.\nImpaired social functioning.\nSelf-injurious behaviors, such as repetitive head banging, slapping, eye poking, etc.\n\nAbnormal Neurological Findings:\nReduced prefrontal cortical regulatory inhibition.\nFunctional imbalance in the basal ganglia and cerebellum.\n\nGrowth and Developmental Assessment:\nDelayed growth and development, or other neurodevelopmental problems.\n\nThreshold Criteria:\nAll items under “Required Criteria” must be met.\nAt least one item under “Supporting Criteria” must be met."}